In [17]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [18]:
data=pd.read_csv('lec25.csv')

In [19]:
data

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [22]:
data=pd.read_table('lec25.csv',sep=',')

In [23]:
data

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [31]:
data=pd.read_csv('lec25.csv',header=None)

In [32]:
data

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [28]:
data=pd.read_csv('lec25.csv',header=None,nrows=2)

In [29]:
data

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [30]:
data

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [33]:
data

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [34]:
data.to_csv('mytext.csv')

In [35]:
#  we import sys to see the output
# we can use other delimeters
import sys

In [37]:
data.to_csv(sys.stdout,sep='-')

-0-1-2-3-4
0-q-r-s-t-apple
1-2-3-4-5-pear
2-a-s-d-f-rabbit
3-5-2-5-7-dog

In [38]:
data.to_csv(sys.stdout,columns=[0,1,2])

,0,1,2
0,q,r,s
1,2,3,4
2,a,s,d
3,5,2,5

In [46]:
# Json with python
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [47]:
import json
jsondata=json.loads(json_obj)

In [48]:
jsondata

{'clothes': None,
 'diet': [{'food': 'grass', 'fur': 'Brown', 'zoo_animal': 'Gazelle'}],
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'zoo_animal': 'Lion'}

In [49]:
# return to make json
json.dumps(jsondata)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [54]:
jsson=DataFrame(jsondata['diet'])

In [55]:
jsson

    food    fur zoo_animal
0  grass  Brown    Gazelle